Revit 2027 API
DirectShapeType.SetOptions Method
 Sets the options to use for this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOptions(
	DirectShapeTypeOptions options
)
Public Sub SetOptions (
	options As DirectShapeTypeOptions
)
public:
void SetOptions(
	DirectShapeTypeOptions^ options
)
member SetOptions :
        options : DirectShapeTypeOptions -> unit
Parameters
options DirectShapeTypeOptions
 Options to use for this DirectShapeType.
Exceptions
Exception | Condition
ArgumentException |  The DirectShapeTypeOptions provided are not valid for this DirectShapeType.
ArgumentNullException |  A non-optional argument was null
Remarks
 The new options take effect immediately.
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace